Revit 2027 API
IExportContext.OnLinkEnd Method
 This method marks the end of a link instance being exported.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
void OnLinkEnd(
	LinkNode node
)
Sub OnLinkEnd (
	node As LinkNode
)
void OnLinkEnd(
	LinkNode^ node
)
abstract OnLinkEnd :
        node : LinkNode -> unit
Parameters
node LinkNode
 An output node that represents a Revit link.
See Also
Reference
IExportContext Interface
Autodesk.Revit.DB Namespace